RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_psram_uhs.c
        tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_PHY_CFG_50);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PSRAM_UHS_PHY_WL_CEN_ANA, 0);
        BL_WR_REG(PSRAM_UHS_BASE, PSRAM_UHS_PHY_CFG_50, tmpVal);
    } else {
        BL_WR_WORD(PSRAM_UHS_BASE + PSRAM_UHS_PHY_CFG_30_OFFSET, 0xAA020010);
        BL_WR_WORD(PSRAM_UHS_BASE + PSRAM_UHS_PHY_CFG_34_OFFSET, 0x04000101);
        BL_WR_WORD(PSRAM_UHS_BASE + PSRAM_UHS_PHY_CFG_38_OFFSET, 0x02070106);
        BL_WR_WORD(PSRAM_UHS_BASE + PSRAM_UHS_PHY_CFG_3C_OFFSET, 0x01f50606);
        BL_WR_WORD(PSRAM_UHS_BASE + PSRAM_UHS_PHY_CFG_44_OFFSET, 0x040a0407);

        tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_PHY_CFG_50);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PSRAM_UHS_PHY_WL_CEN_ANA, 0);
        BL_WR_REG(PSRAM_UHS_BASE, PSRAM_UHS_PHY_CFG_50, tmpVal);
    }
    return 0;
}

static void power_up_ldo12uhs(void)
{
    uint32_t tmpVal = 0;
    tmpVal = BL_RD_REG(GLB_BASE, GLB_LDO12UHS);

#ifdef BL808D_REWORK
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_LDO12UHS_PULLDOWN, 0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_LDO12UHS_PULLDOWN_SEL, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_PU_LDO12UHS, 0);
#else
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_PU_LDO12UHS, 1);
    BL_WR_REG(GLB_BASE, GLB_LDO12UHS, tmpVal);
    arch_delay_us(300);

    tmpVal = BL_RD_REG(GLB_BASE, GLB_LDO12UHS);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_LDO12UHS_VOUT_SEL, 6);
#endif
    BL_WR_REG(GLB_BASE, GLB_LDO12UHS, tmpVal);
    arch_delay_us(1);
}

static void set_cen_ck_ckn(void)
{
    uint32_t tmpVal = 0;
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_PHY_CFG_50);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PSRAM_UHS_DQ_OE_MID_N_REG, 0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PSRAM_UHS_DQ_OE_MID_P_REG, 0);
    BL_WR_REG(PSRAM_UHS_BASE, PSRAM_UHS_PHY_CFG_50, tmpVal);
    arch_delay_us(1);
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_PHY_CFG_40);
    tmpVal &= 0xFFFCFFFF;
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PSRAM_UHS_REG_UHS_DMY0, 1);
    BL_WR_REG(PSRAM_UHS_BASE, PSRAM_UHS_PHY_CFG_40, tmpVal);
    arch_delay_us(1);
}

static int set_or_uhs(uint32_t datarate)
{
    uint32_t tmpVal = 0;
    uint32_t *uhs_phy_cfg_base_addr = (uint32_t *)(PSRAM_UHS_BASE + PSRAM_UHS_PHY_CFG_00_OFFSET);
    // clang-format off
    const static uint32_t uhs_phy_cfg_data[] ={
    0x802b0200, 0x60206020, 0x70027002, 0x70027002,
    0x70027002, 0x70027002, 0x70027002, 0x70027002,
    0x70027002, 0x70027002, 0x26000000, 0x26000006,
    };
    // clang-format on

    for (uint32_t i = 0; i < 12; i++) {
        uhs_phy_cfg_base_addr[i] = uhs_phy_cfg_data[i];
    }

    tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_PHY_CFG_30);
    tmpVal &= 0x08ffffff;
    tmpVal |= 0x07000000;
    BL_WR_REG(PSRAM_UHS_BASE, PSRAM_UHS_PHY_CFG_30, tmpVal);

    tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_PHY_CFG_48);
    tmpVal &= 0xfffffcff;
    tmpVal |= 0x00000200;
    BL_WR_REG(PSRAM_UHS_BASE, PSRAM_UHS_PHY_CFG_48, tmpVal);

    tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_PHY_CFG_4C);
    tmpVal &= 0xffe0ffff;
    BL_WR_REG(PSRAM_UHS_BASE, PSRAM_UHS_PHY_CFG_4C, tmpVal);

    tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_PHY_CFG_50);
    tmpVal &= 0xff88ff88;
    tmpVal |= 0x00330033;
    BL_WR_REG(PSRAM_UHS_BASE, PSRAM_UHS_PHY_CFG_50, tmpVal);

    arch_delay_us(1);

    return 0;
}
static void switch_to_ldo12uhs(void)
{
    uint32_t tmpVal = 0;
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_PHY_CFG_40);
    tmpVal &= 0xFFCFFFFF;
    BL_WR_REG(PSRAM_UHS_BASE, PSRAM_UHS_PHY_CFG_40, tmpVal);
    arch_delay_us(1);
}

static void release_cen_ck_ckn(void)
{
    uint32_t tmpVal = 0;
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_PHY_CFG_40);
    tmpVal &= 0xFFFCFEFF;
#ifdef BL808D_REWORK
    tmpVal |= 0x10000;
#else
    tmpVal |= 0x30000;
#endif
    BL_WR_REG(PSRAM_UHS_BASE, PSRAM_UHS_PHY_CFG_40, tmpVal);
    arch_delay_us(1);

    tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_PHY_CFG_50);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PSRAM_UHS_DQ_OE_MID_N_REG, 3);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PSRAM_UHS_DQ_OE_MID_P_REG, 3);
    BL_WR_REG(PSRAM_UHS_BASE, PSRAM_UHS_PHY_CFG_50, tmpVal);
    arch_delay_us(1);
}

static void Psram_analog_init(uint32_t pck_freq)
{
    /* power on ldo12 */
    power_up_ldo12uhs();

    /* set cen ck ckn */
    set_cen_ck_ckn();

    /*
     * overwrite default register content
     * only support 2000M and 1500MHZ
     */
    set_or_uhs(pck_freq);

    /* switch to ldo12 */
    switch_to_ldo12uhs();

    /* release cen ck */
    release_cen_ck_ckn();

    /* config phy paramater */
    config_uhs_phy(pck_freq);
}

/****************************************************************************/ /**
 * @brief  Init Psram UHS ,set auto refresh cycle
 *
 * @param  cfg: pck frequency unit is MHZ
 *
 * @return None
 *
*******************************************************************************/
void Psram_UHS_Init(PSRAM_UHS_Cfg_Type *cfg)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_PSRAM_UHS_MEM_SIZE_TYPE(cfg->psramMemSize));
    CHECK_PARAM(IS_PSRAM_UHS_PAGE_SIZE_TYPE(cfg->psramPageSize));

    if (cfg->pck_freq > 2300) {
        /* max support 2300MHZ */
        while (1)
            ;
    } else if (cfg->pck_freq > 1600) {
        BL_WR_WORD(PSRAM_UHS_BASE + PSRAM_UHS_UHS_TIMING_CTRL_OFFSET, 0x1a03000f);
    } else {
        BL_WR_WORD(PSRAM_UHS_BASE + PSRAM_UHS_UHS_TIMING_CTRL_OFFSET, 0x1202000b);
    }

    Psram_analog_init(cfg->pck_freq);

    /* Wait 150 us */
    arch_delay_us(150);

    /* set refresh paramater */
    /* 1. auto refresh clock source is pck_t, Adjust pck_t_div so that the frequency is around ~50Mhz */
/*     tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_MANUAL);
    tmpVal &= 0x00ffffff;

    if (cfg->pck_freq >= 2200) {
        tmpVal |= 0x05000000;
    } else if (cfg->pck_freq >= 2000) {
        tmpVal |= 0x04000000;
    } else if (cfg->pck_freq >= 1500) {
        tmpVal |= 0x03000000;
    } else if (cfg->pck_freq >= 1400) {
        tmpVal |= 0x02000000;
    } else if (cfg->pck_freq >= 666) {
        tmpVal |= 0x01000000;
    }
    BL_WR_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_MANUAL, tmpVal); */
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_MANUAL);
    tmpVal &= 0x00ffffff;

