RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_psram_uhs.c
    if (cfg->pck_freq >= 2200) {
        tmpVal |= 0x05000000;
    } else if (cfg->pck_freq >= 1800) {
        tmpVal |= 0x04000000;
    } else if (cfg->pck_freq >= 1500) {
        tmpVal |= 0x03000000;
    } else if (cfg->pck_freq >= 1400) {
        tmpVal |= 0x02000000;
    } else if (cfg->pck_freq >= 666) {
        tmpVal |= 0x01000000;
    }
    BL_WR_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_MANUAL, tmpVal);

    /* 2. setting refresh windows cycle count
     * reg_win_cycle = refresh_window / Tpck_y
     *
     * refresh_window unit is ms
     * when refresh tempotory > 85
     *      refresh_window = 16
     * elsee
     *      refresh_window = 32
     */
    if (cfg->isHighTem == PSRAM_UHS_NORMAL_TEMP) {
        BL_WR_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_AUTO_FRESH_1, 0x16e360);
    } else {
        BL_WR_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_AUTO_FRESH_1, 0xB71B0);
    }
    /* 3 & 4. setting refresh count in a windows fixed value 4096 in v0.2
     * calculate Average cycle between two auto-refresh
     * reg_refi_cycle = reg_win_cycle / reg_win_ref_cnt
     * */
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_AUTO_FRESH_2);
    // tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PSRAM_UHS_REG_WIN_REF_CNT, 0x1000);
    if (cfg->isHighTem == PSRAM_UHS_NORMAL_TEMP) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PSRAM_UHS_REG_REFI_CYCLE, (370));
    } else {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PSRAM_UHS_REG_REFI_CYCLE, (190));
    }
    BL_WR_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_AUTO_FRESH_2, tmpVal);

    /* 5 setting single auto refresh time */
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_AUTO_FRESH_4);
    // tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PSRAM_UHS_REG_BUST_CYCLE, (uint32_t)(90 / T_pck_t));
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PSRAM_UHS_REG_BUST_CYCLE, 5);
    BL_WR_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_AUTO_FRESH_4, tmpVal);

    /* 6 auto-refesh enable */
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_BASIC);
    tmpVal = BL_SET_REG_BIT(tmpVal, PSRAM_UHS_REG_AF_EN);

    /* 7&8 . set psram memory size and page size */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PSRAM_UHS_REG_ADDRMB_MSK, cfg->psramMemSize);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PSRAM_UHS_REG_LINEAR_BND_B, cfg->psramPageSize);
    BL_WR_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_BASIC, tmpVal);

    /* 9. psram enable initial */
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_BASIC);
    tmpVal = BL_SET_REG_BIT(tmpVal, PSRAM_UHS_REG_INIT_EN);
    BL_WR_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_BASIC, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Read register for uhs
 *
 * @param  reg_addr: read addr
 * @param  regVal: regVal
 *
 * @return success or not
 *
*******************************************************************************/
int PSram_UHS_Read_Reg(uint32_t reg_addr, uint8_t *regVal)
{
    uint32_t tmpVal = 0;
    uint32_t cnt = 0;

    /* 1 generate requeset and wait authorization*/
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_BASIC);
    tmpVal = BL_SET_REG_BIT(tmpVal, PSRAM_UHS_REG_CONFIG_REQ);
    BL_WR_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_BASIC, tmpVal);

    do {
        tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_BASIC);
        cnt++;
        if (cnt > PSRAM_UHS_RW_TIMEOUT)
            return -1;
    } while (!BL_IS_REG_BIT_SET(tmpVal, PSRAM_UHS_REG_CONFIG_GNT));

    /* 2 set mode reg */
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_BASIC);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PSRAM_UHS_REG_MODE_REG, reg_addr);
    BL_WR_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_BASIC, tmpVal);

    /* 3 enable controller Rx*/
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_CMD);
    tmpVal = BL_SET_REG_BIT(tmpVal, PSRAM_UHS_REG_REGR_PULSE);
    BL_WR_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_CMD, tmpVal);

    cnt = 0;

    /* 4 wait read done */
    do {
        tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_CMD);
        cnt++;
        if (cnt > PSRAM_UHS_RW_TIMEOUT)
            return -1;
    } while (!BL_IS_REG_BIT_SET(tmpVal, PSRAM_UHS_STS_REGR_DONE));

    /* 5 steup up read data */
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_CMD);

    *regVal = (uint8_t)(BL_GET_REG_BITS_VAL(tmpVal, PSRAM_UHS_STS_CONFIG_READ));

    /* 6 cancel requeset singnal */
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_BASIC);
    tmpVal = BL_CLR_REG_BIT(tmpVal, PSRAM_UHS_REG_CONFIG_REQ);
    BL_WR_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_BASIC, tmpVal);

    return 0;
}

/****************************************************************************/ /**
 * @brief  write register for winbond PSRAM
 *
 * @param  regCfg: wirte reg data
 *
 * @return None
 *
*******************************************************************************/
int PSram_UHS_Write_Reg(PSRAM_UHS_Write_Reg_Cfg_Type *regCfg)
{
    uint32_t tmpVal = 0;
    uint32_t cnt = 0;
    uint8_t regWriteList[] = { 0, 2 };
    uint8_t i = 0;

    CHECK_PARAM(IS_PSRAM_UHS_DRIVER_ST_TYPE(regCfg->driver_st));
    CHECK_PARAM(IS_PSRAM_UHS_WARP_BURST_TYPE(regCfg->burst_size));
    CHECK_PARAM(IS_PSRAM_UHS_LATENCY_TYPE(regCfg->lentency));

    /* 1 congfi write reg*/
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_PSRAM_CONFIGURE);

    switch (regCfg->burst_size) {
        case PSRAM_UHS_WARP_BURST_64:
            tmpVal = BL_SET_REG_BIT(tmpVal, PSRAM_UHS_REG_UHS_BL_64);
            tmpVal = BL_CLR_REG_BIT(tmpVal, PSRAM_UHS_REG_UHS_BL_32);
            tmpVal = BL_CLR_REG_BIT(tmpVal, PSRAM_UHS_REG_UHS_BL_16);
            break;
        case PSRAM_UHS_WARP_BURST_32:
            tmpVal = BL_CLR_REG_BIT(tmpVal, PSRAM_UHS_REG_UHS_BL_16);
            tmpVal = BL_SET_REG_BIT(tmpVal, PSRAM_UHS_REG_UHS_BL_32);
            tmpVal = BL_CLR_REG_BIT(tmpVal, PSRAM_UHS_REG_UHS_BL_64);
            break;
        case PSRAM_UHS_WARP_BURST_16:
            tmpVal = BL_SET_REG_BIT(tmpVal, PSRAM_UHS_REG_UHS_BL_16);
            tmpVal = BL_CLR_REG_BIT(tmpVal, PSRAM_UHS_REG_UHS_BL_32);
            tmpVal = BL_CLR_REG_BIT(tmpVal, PSRAM_UHS_REG_UHS_BL_64);
            break;
        case PSRAM_UHS_WARP_BURST_NONE:
            tmpVal = BL_CLR_REG_BIT(tmpVal, PSRAM_UHS_REG_UHS_BL_16);
            tmpVal = BL_CLR_REG_BIT(tmpVal, PSRAM_UHS_REG_UHS_BL_32);
            tmpVal = BL_CLR_REG_BIT(tmpVal, PSRAM_UHS_REG_UHS_BL_64);
            break;
        default:
            return -1;
    }
    if (regCfg->driver_st != PSRAM_UHS_DRIVER_ST_NO_CHANGE) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PSRAM_UHS_REG_UHS_DRIVE_ST, regCfg->driver_st);
    }
    if (regCfg->lentency != PSRAM_UHS_LATENCY_NO_CHANGE) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PSRAM_UHS_REG_UHS_LATENCY, regCfg->lentency);
    }

    BL_WR_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_PSRAM_CONFIGURE, tmpVal);

    /* 2 generate requeset and wait authorization */
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_BASIC);
    tmpVal = BL_SET_REG_BIT(tmpVal, PSRAM_UHS_REG_CONFIG_REQ);
    BL_WR_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_BASIC, tmpVal);

    do {
        tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_BASIC);
        cnt++;
        if (cnt > PSRAM_UHS_RW_TIMEOUT)
            return -1;
    } while (!BL_IS_REG_BIT_SET(tmpVal, PSRAM_UHS_REG_CONFIG_GNT));

