RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_psram_uhs.c
            /* 4 enable controller */
            tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_CMD);
            tmpVal = BL_SET_REG_BIT(tmpVal, PSRAM_UHS_REG_REGW_PULSE);
            BL_WR_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_CMD, tmpVal);

            cnt = 0;

            /* 5 wait write done */
            do {
                tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_CMD);
                cnt++;
                if (cnt > PSRAM_UHS_RW_TIMEOUT)
                    goto exit;
            } while (!BL_IS_REG_BIT_SET(tmpVal, PSRAM_UHS_STS_REGW_DONE));
            break;
        default:
            goto exit;
            break;
    }

    BL_WR_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_CMD, tmpVal);

    cnt = 0;

    /*  wait write done */
    switch (cmd) {
        case PSRAM_UHS_CMD_SELF_REFRESH_IN:
            do {
                tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_CMD);
                cnt++;
                if (cnt > PSRAM_UHS_RW_TIMEOUT)
                    goto exit;

            } while (!BL_IS_REG_BIT_SET(tmpVal, PSRAM_UHS_STS_SRFI_DONE));
            break;
        case PSRAM_UHS_CMD_SELF_REFRESH_EXIT:
            do {
                tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_CMD);
                cnt++;
                if (cnt > PSRAM_UHS_RW_TIMEOUT)
                    goto exit;

            } while (!BL_IS_REG_BIT_SET(tmpVal, PSRAM_UHS_STS_SRFO_DONE));
            break;
        case PSRAM_UHS_CMD_GLOBAL_RESET:
            do {
                tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_CMD);
                cnt++;
                if (cnt > PSRAM_UHS_RW_TIMEOUT)
                    goto exit;

            } while (!BL_IS_REG_BIT_SET(tmpVal, PSRAM_UHS_STS_GLBR_DONE));
            break;
        default:
            goto exit;
    }

    /* 6 cancel requeset singnal */
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_BASIC);
    tmpVal = BL_CLR_REG_BIT(tmpVal, PSRAM_UHS_REG_CONFIG_REQ);
    BL_WR_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_BASIC, tmpVal);

    return 0;

exit:
    /* 6 cancel requeset singnal */
    tmpVal = BL_RD_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_BASIC);
    tmpVal = BL_CLR_REG_BIT(tmpVal, PSRAM_UHS_REG_CONFIG_REQ);
    BL_WR_REG(PSRAM_UHS_BASE, PSRAM_UHS_UHS_BASIC, tmpVal);

    return -1;
}

/**
 * @brief defualt init for 64MB x16 UHS PSRAM
 *        user should enable UHS PSRAM PLL before call this function
 * @param uhs_pll_clk The uhs pll frequency used
 */
void Psram_UHS_x16_Init(uint32_t uhs_pll_clk)
{
    PSRAM_UHS_Cfg_Type psramDefaultCfg = {
        2000,
        PSRAM_MEM_SIZE_64MB,
        PSRAM_PAGE_SIZE_2KB,
        PSRAM_UHS_NORMAL_TEMP,
    };

    PSRAM_UHS_Write_Reg_Cfg_Type writeReg = {
        PSRAM_UHS_DRIVER_ST_40_PDPU,
        PSRAM_UHS_WARP_BURST_NONE,
        PSRAM_UHS_LATENCY_W18_R37_MAX_FRE_1066_MHZ,
    };

    psramDefaultCfg.pck_freq = uhs_pll_clk;

    if ((uhs_pll_clk >= 2000) && (uhs_pll_clk <= 2300)) {
        writeReg.lentency = PSRAM_UHS_LATENCY_W18_R37_MAX_FRE_1066_MHZ;
    } else if ((uhs_pll_clk <= 1600) && (uhs_pll_clk > 1066)) {
        writeReg.lentency = PSRAM_UHS_LATENCY_W14_R29_MAX_FRE_800_MHZ;
    } else if ((uhs_pll_clk < 1067) && (uhs_pll_clk > 800)) {
        writeReg.lentency = PSRAM_UHS_LATENCY_W10_R20_MAX_FRE_533_MHZ;
    } else if ((uhs_pll_clk <= 800) && (uhs_pll_clk > 667)) {
        writeReg.lentency = PSRAM_UHS_LATENCY_W6_R16_MAX_FRE_400_MHZ;
    } else if ((uhs_pll_clk < 667) && (uhs_pll_clk > 400)) {
        writeReg.lentency = PSRAM_UHS_LATENCY_W5_R13_MAX_FRE_333_MHZ;
    } else if (uhs_pll_clk <= 400) {
        writeReg.lentency = PSRAM_UHS_LATENCY_W5_R9_MAX_FRE_200_MHZ;
    }

    /* first initial psram controller*/
    Psram_UHS_Init(&psramDefaultCfg);

    /* reset psram device*/
    PSram_UHS_Construct_Cmd(PSRAM_UHS_CMD_GLOBAL_RESET);

    arch_delay_us(100);

    /* write 1GHZ configuration to psram device */
    PSram_UHS_Write_Reg(&writeReg);
}

/*@} end of group PSRAM_UHS_Public_Functions */

/*@} end of group PSRAM_UHS */

/*@} end of group BL808_Peripheral_Driver */
